Cttangg/stm32project/2.8-inch_LCD_Driver/Core/Lib/lcd.c
#include "lcd.h"
#include "FONT.H"
#include "delay.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_ll_fsmc.h"
#include "main.h"

/**
 ******************************************************************************
 * @file    lcd.c
 * @brief   TFT-LCD 驱动实现 — FSMC 并口, 多驱动 IC 自适应
 *
 *          支持 2.4/2.8/3.5/4.3 寸 TFT, 驱动 IC 包括 ILI9341/ILI9325/
 *          ILI9328/ILI9320/RM68042/RM68021/LGDP4531/LGDP4535/SPFD5408/
 *          1505/B505/C505/NT35310/NT35510 等.
 *
 *          基于正点原子 STM32F4 例程 (V2.8 20140721) 改造:
 *           - LCD_Init() 自动读取驱动 IC ID 并装载对应初始化序列
 *           - 底层 FSMC 并口时序由本文件配置
 *           - 默认竖屏显示, 可用 LCD_Display_Dir() 在线切换横竖屏
 ******************************************************************************
 */

/* ========================================================================= */
/*  全局变量                                                                  */
/* ========================================================================= */

/** 画笔颜色 (绘制点/线/字符时使用, 默认黑色) */
u16 POINT_COLOR=0x0000;
/** 背景色 (默认白色) */
u16 BACK_COLOR=0xFFFF;

/**
 * LCD 重要参数 (宽高/ID/扫描方向/寄存器指令).
 * 默认竖屏 (240x320), 由 LCD_Display_Dir() 修改
 */
_lcd_dev lcddev;
/* 历史修改说明 (正点原子 STM32F4 TFT 驱动 V2.8 20140721):
 *  V1.2: 支持 SPFD5408, LCD ID 以 HEX 打印
 *  V1.3: 快速 IO; 修改背光极性 (适用 V1.8 及以后开发板)
 *  V1.4: LCD_ShowChar 改用画点实现; 支持横竖屏
 *  V1.5: 修复 B505 读颜色 bug
 *  V1.6: 支持 LGDP4535
 *  V1.7: 新增 LCD_RD_DATA / ILI9341 支持 / ILI9325 独立驱动 / LCD_Scan_Dir
 *  V1.8: 新增 lcddev 结构体 / LCD_Display_Dir 在线切换横竖屏
 *  V1.9: 新增 RM68042 (6804 曾不支持横屏)
 *  V2.0: 无法识别 ID (读为 9300) 时强制按 ILI9341 初始化
 *  V2.1~V2.2: 修复 ILI9325 读颜色 / LCD_Scan_Dir bug
 *  V2.3: 6804 支持横屏
 *  V2.4~V2.5: 新增 NT35310 (5310) / NT35510 (5510)
 *  V2.6: 新增 24x24 ASCII 字体; 优化 9341/35310/35510 写时序; 去掉 SSD1289
 *  V2.7: 修复 LCD_Color_Fill / LCD_Scan_Dir bug
 *  V2.8: 解决 MDK -O2 优化下 LCD_ReadPoint 读点失效 */

/**
 * @brief  写 LCD 寄存器序号 (仅写 REG 地址, 用于发寄存器命令)
 * @param  regval: 寄存器值
 * @note   空操作赋值兼容 MDK -O2 优化
 */
void LCD_WR_REG(vu16 regval)
{   
	regval=regval;		//使用-O2优化的时候,必须插入的延时
	LCD->LCD_REG=regval;//写入要写的寄存器序号	 
}
/**
 * @brief  写 LCD 数据 (仅写 RAM 地址, 用于写寄存器数据/GRAM)
 * @param  data: 要写入的值
 */
void LCD_WR_DATA(vu16 data)
{	 
	data=data;			//使用-O2优化的时候,必须插入的延时
	LCD->LCD_RAM=data;		 
}
/**
 * @brief  读 LCD 数据
 * @retval 读到的值
 */
u16 LCD_RD_DATA(void)
{		
	vu16 ram;			//防止被优化
	ram=LCD->LCD_RAM;
	return ram;		 
}					   
/**
 * @brief  写 LCD 寄存器 (寄存器地址 + 数据)
 * @param  LCD_Reg: 寄存器地址
 * @param  LCD_RegValue: 要写入的数据
 */
void LCD_WriteReg(vu16 LCD_Reg, vu16 LCD_RegValue)
{	
	LCD->LCD_REG = LCD_Reg;		//写入要写的寄存器序号	 
	LCD->LCD_RAM = LCD_RegValue;//写入数据	    		 
}	   
/**
 * @brief  读 LCD 寄存器
 * @param  LCD_Reg: 寄存器地址
 * @retval 读到的数据
 */
u16 LCD_ReadReg(vu16 LCD_Reg)
{										   
	LCD_WR_REG(LCD_Reg);		//写入要读的寄存器序号
	delay_us(5);		  
	return LCD_RD_DATA();		//返回读到的值
}   
/** @brief 发送开始写 GRAM 命令 (设置光标后调用) */
void LCD_WriteRAM_Prepare(void)
{
 	LCD->LCD_REG=lcddev.wramcmd;	  
}	 
/**
 * @brief  写一个像素颜色到 GRAM
 * @param  RGB_Code: RGB565 颜色值
 */
void LCD_WriteRAM(u16 RGB_Code)
{							    
	LCD->LCD_RAM = RGB_Code;//写十六位GRAM
}
/**
 * @brief  颜色格式转换: GBR -> RGB
 * @param  c: GBR 格式的颜色值 (ILI93xx 读出数据)
 * @retval RGB 格式的颜色值
 */
u16 LCD_BGR2RGB(u16 c)
{
	u16  r,g,b,rgb;   
	b=(c>>0)&0x1f;
	g=(c>>5)&0x3f;
	r=(c>>11)&0x1f;	 
	rgb=(b<<11)+(g<<5)+(r<<0);		 
	return(rgb);
} 
/**
 * @brief  软件空循环延时 (兼容 MDK -O1/-O2 时间优化)
 * @param  i: 循环次数
 */
void opt_delay(u8 i)
{
	while(i--);
}
/**
 * @brief  读取指定点的颜色值
 * @param  x: 横坐标
 * @param  y: 纵坐标
 * @retval 该点颜色 (RGB565); 坐标越界返回 0
 */
u16 LCD_ReadPoint(u16 x,u16 y)
{
 	vu16 r=0,g=0,b=0;
	if(x>=lcddev.width||y>=lcddev.height)return 0;	//超过了范围,直接返回		   
	LCD_SetCursor(x,y);	    
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X2E);//9341/6804/3510 发送读GRAM指令
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2E00);	//5510 发送读GRAM指令
	else LCD_WR_REG(R34);      		 				//其他IC发送读GRAM指令
	if(lcddev.id==0X9320)opt_delay(2);				//FOR 9320,延时2us	    
 	LCD_RD_DATA();									//dummy Read	   
	opt_delay(2);	  
 	r=LCD_RD_DATA();  		  						//实际坐标颜色
 	if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X5510)		//9341/NT35310/NT35510要分2次读出
 	{
		opt_delay(2);	  
		b=LCD_RD_DATA(); 
		g=r&0XFF;		//对于9341/5310/5510,第一次读取的是RG的值,R在前,G在后,各占8位
		g<<=8;
	} 
	if(lcddev.id==0X9325||lcddev.id==0X4535||lcddev.id==0X4531||lcddev.id==0XB505||lcddev.id==0XC505)return r;	//这几种IC直接返回颜色值
	else if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X5510)return (((r>>11)<<11)|((g>>10)<<5)|(b>>11));//ILI9341/NT35310/NT35510需要公式转换一下
	else return LCD_BGR2RGB(r);						//其他IC
}			 
/** @brief 开启 LCD 显示 */
void LCD_DisplayOn(void)
{					   
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X29);	//开启显示
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2900);	//开启显示
	else LCD_WriteReg(R7,0x0173); 				 	//开启显示
}	 
/** @brief 关闭 LCD 显示 */
void LCD_DisplayOff(void)
{	   
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X28);	//关闭显示
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2800);	//关闭显示
	else LCD_WriteReg(R7,0x0);//关闭显示 
}   
/**
 * @brief  设置光标位置 (写 GRAM 的起始坐标)
 * @param  Xpos: 横坐标
 * @param  Ypos: 纵坐标
 */
void LCD_SetCursor(u16 Xpos, u16 Ypos)
{	 
 	if(lcddev.id==0X9341||lcddev.id==0X5310)
	{		    
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_DATA(Ypos&0XFF);
	}else if(lcddev.id==0X6804)
	{
		if(lcddev.dir==1)Xpos=lcddev.width-1-Xpos;//横屏时处理
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_DATA(Ypos&0XFF);
	}else if(lcddev.id==0X5510)
	{
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_REG(lcddev.setxcmd+1); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_REG(lcddev.setycmd+1); 
		LCD_WR_DATA(Ypos&0XFF);		
	}else
	{
		if(lcddev.dir==1)Xpos=lcddev.width-1-Xpos;//横屏其实就是调转x,y坐标
		LCD_WriteReg(lcddev.setxcmd, Xpos);
		LCD_WriteReg(lcddev.setycmd, Ypos);
	}	 
} 		 
/**
 * @brief  设置 LCD 自动扫描方向
 * @param  dir: 0~7, 代表 8 个方向 (定义见 lcd.h)
 * @warning 一般保持默认 L2R_U2D 即可; 其他扫描方式可能导致显示不正常
 *          (尤其是 9341/6804)
 */
void LCD_Scan_Dir(u8 dir)
{
	u16 regval=0;
	u16 dirreg=0;
	u16 temp;  
	u16 xsize,ysize;
	if(lcddev.dir==1&&lcddev.id!=0X6804)//横屏时，对6804不改变扫描方向！
	{			   
		switch(dir)//方向转换
		{
			case 0:dir=6;break;
			case 1:dir=7;break;
			case 2:dir=4;break;
			case 3:dir=5;break;
			case 4:dir=1;break;
			case 5:dir=0;break;
			case 6:dir=3;break;
			case 7:dir=2;break;	     
		}
	}
	if(lcddev.id==0x9341||lcddev.id==0X6804||lcddev.id==0X5310||lcddev.id==0X5510)//9341/6804/5310/5510,很特殊
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(0<<7)|(0<<6)|(0<<5); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(1<<7)|(0<<6)|(0<<5); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(0<<7)|(1<<6)|(0<<5); 
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(1<<7)|(1<<6)|(0<<5); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(0<<7)|(0<<6)|(1<<5); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(0<<7)|(1<<6)|(1<<5); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(1<<7)|(0<<6)|(1<<5); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(1<<7)|(1<<6)|(1<<5); 
				break;	 
		}
		if(lcddev.id==0X5510)dirreg=0X3600;
		else dirreg=0X36;
 		if((lcddev.id!=0X5310)&&(lcddev.id!=0X5510))regval|=0X08;//5310/5510不需要BGR   
		if(lcddev.id==0X6804)regval|=0x02;//6804的BIT6和9341的反了	   
		LCD_WriteReg(dirreg,regval);
 		if((regval&0X20)||lcddev.dir==1)
		{
			if(lcddev.width<lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}else  
		{
			if(lcddev.width>lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}  
		if(lcddev.dir==1&&lcddev.id!=0X6804)
		{
			xsize=lcddev.height;
			ysize=lcddev.width;
		}else
		{
			xsize=lcddev.width;
			ysize=lcddev.height;
		}
		if(lcddev.id==0X5510)
		{
			LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA((xsize-1)>>8); 
			LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA((xsize-1)&0XFF); 
			LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA((ysize-1)>>8); 
			LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA((ysize-1)&0XFF);
		}else
		{
			LCD_WR_REG(lcddev.setxcmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((xsize-1)>>8);LCD_WR_DATA((xsize-1)&0XFF);
			LCD_WR_REG(lcddev.setycmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((ysize-1)>>8);LCD_WR_DATA((ysize-1)&0XFF);  
		}
  	}else 
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(1<<5)|(1<<4)|(0<<3); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(0<<5)|(1<<4)|(0<<3); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(1<<5)|(0<<4)|(0<<3);
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(0<<5)|(0<<4)|(0<<3); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(1<<5)|(1<<4)|(1<<3); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(1<<5)|(0<<4)|(1<<3); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(0<<5)|(1<<4)|(1<<3); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(0<<5)|(0<<4)|(1<<3); 
				break;	 
		}
		if(lcddev.id==0x8989)//8989 IC
		{
			dirreg=0X11;
			regval|=0X6040;	//65K   
	 	}else//其他驱动IC		  
		{
			dirreg=0X03;
			regval|=1<<12;  
		}
		LCD_WriteReg(dirreg,regval);
	}
}     
/**
 * @brief  画点 (颜色取全局画笔颜色 POINT_COLOR)
 * @param  x: 横坐标
 * @param  y: 纵坐标
 */
void LCD_DrawPoint(u16 x,u16 y)
{
	LCD_SetCursor(x,y);		//设置光标位置 
	LCD_WriteRAM_Prepare();	//开始写入GRAM
	LCD->LCD_RAM=POINT_COLOR; 
}
/**
 * @brief  快速画点 (直接指定颜色, 内联坐标设置, 速度优于 LCD_DrawPoint)
 * @param  x: 横坐标
 * @param  y: 纵坐标
 * @param  color: 颜色 (RGB565)
 */
void LCD_Fast_DrawPoint(u16 x,u16 y,u16 color)
{	   
	if(lcddev.id==0X9341||lcddev.id==0X5310)
	{
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(x>>8); 
		LCD_WR_DATA(x&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(y>>8); 
		LCD_WR_DATA(y&0XFF);
	}else if(lcddev.id==0X5510)
	{
		LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(x>>8);  
		LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(x&0XFF);	  
		LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(y>>8);  
		LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(y&0XFF); 
	}else if(lcddev.id==0X6804)
	{		    
		if(lcddev.dir==1)x=lcddev.width-1-x;//横屏时处理
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(x>>8); 
		LCD_WR_DATA(x&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(y>>8); 
		LCD_WR_DATA(y&0XFF);
	}else
	{
 		if(lcddev.dir==1)x=lcddev.width-1-x;//横屏其实就是调转x,y坐标
		LCD_WriteReg(lcddev.setxcmd,x);
		LCD_WriteReg(lcddev.setycmd,y);
	}			 
	LCD->LCD_REG=lcddev.wramcmd; 
	LCD->LCD_RAM=color; 
}	 


/**
 * @brief  设置 LCD 显示方向 (在线切换)
 * @param  dir: 0=竖屏 (240x320); 1=横屏 (320x240)
 */
void LCD_Display_Dir(u8 dir)
{
	if(dir==0)			//竖屏
	{
		lcddev.dir=0;	//竖屏
		lcddev.width=240;
		lcddev.height=320;
		if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)
		{
			lcddev.wramcmd=0X2C;
	 		lcddev.setxcmd=0X2A;
			lcddev.setycmd=0X2B;  	 
			if(lcddev.id==0X6804||lcddev.id==0X5310)
			{
				lcddev.width=320;
				lcddev.height=480;
			}
		}else if(lcddev.id==0x5510)
		{
			lcddev.wramcmd=0X2C00;
	 		lcddev.setxcmd=0X2A00;
			lcddev.setycmd=0X2B00; 
			lcddev.width=480;
			lcddev.height=800;
		}else
		{
			lcddev.wramcmd=R34;
	 		lcddev.setxcmd=R32;
			lcddev.setycmd=R33;  
		}
	}else 				//横屏
	{	  				
		lcddev.dir=1;	//横屏
		lcddev.width=320;
		lcddev.height=240;
		if(lcddev.id==0X9341||lcddev.id==0X5310)
		{
			lcddev.wramcmd=0X2C;
	 		lcddev.setxcmd=0X2A;
			lcddev.setycmd=0X2B;  	 
		}else if(lcddev.id==0X6804)	 
		{
 			lcddev.wramcmd=0X2C;
	 		lcddev.setxcmd=0X2B;
			lcddev.setycmd=0X2A; 
		}else if(lcddev.id==0x5510)
		{
			lcddev.wramcmd=0X2C00;
	 		lcddev.setxcmd=0X2A00;
			lcddev.setycmd=0X2B00; 
			lcddev.width=800;
			lcddev.height=480;
		}else
		{
			lcddev.wramcmd=R34;
	 		lcddev.setxcmd=R33;
			lcddev.setycmd=R32;  
		}
		if(lcddev.id==0X6804||lcddev.id==0X5310)
		{ 	 
			lcddev.width=480;
			lcddev.height=320; 			
		}
	} 
	LCD_Scan_Dir(LCD_DFT_SCAN_DIR);	//默认扫描方向 (lcd_conf.h)
#if (LCD_PANEL_W > 0) && (LCD_PANEL_H > 0)
	/* 面板物理尺寸覆盖 (lcd_conf.h): 换装同 IC 不同尺寸屏时生效 */
	lcddev.width  = LCD_PANEL_W;
	lcddev.height = LCD_PANEL_H;
#endif
}	 
/**
 * @brief  设置显示窗口, 并自动将画点坐标移到窗口左上角
 * @param  sx: 窗口起始横坐标 (左上角)
 * @param  sy: 窗口起始纵坐标 (左上角)
 * @param  width: 窗口宽度 (必须 > 0)
 * @param  height: 窗口高度 (必须 > 0)
 * @note   RM68042 横屏时不支持窗口设置
 */
void LCD_Set_Window(u16 sx,u16 sy,u16 width,u16 height)
{   
	u8 hsareg,heareg,vsareg,veareg;
	u16 hsaval,heaval,vsaval,veaval; 
	width=sx+width-1;
	height=sy+height-1;
	if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X6804)//6804横屏不支持
	{
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(sx>>8); 
		LCD_WR_DATA(sx&0XFF);	 
		LCD_WR_DATA(width>>8); 
		LCD_WR_DATA(width&0XFF);  
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(sy>>8); 
		LCD_WR_DATA(sy&0XFF); 
		LCD_WR_DATA(height>>8); 
		LCD_WR_DATA(height&0XFF); 
	}else if(lcddev.id==0X5510)
	{
		LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(sx>>8);  
		LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(sx&0XFF);	  
		LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA(width>>8);   
		LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA(width&0XFF);   
		LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(sy>>8);   
		LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(sy&0XFF);  
		LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA(height>>8);   
		LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA(height&0XFF);  
	}else	//其他驱动IC
	{
		if(lcddev.dir==1)//横屏
		{
			//窗口值
			hsaval=sy;				
			heaval=height;
			vsaval=lcddev.width-width-1;
			veaval=lcddev.width-sx-1;				
		}else
		{ 
			hsaval=sx;				
			heaval=width;
			vsaval=sy;
			veaval=height;
		} 
		hsareg=0X50;heareg=0X51;//水平方向窗口寄存器
		vsareg=0X52;veareg=0X53;//垂直方向窗口寄存器	   							  
		//设置寄存器值
		LCD_WriteReg(hsareg,hsaval);
		LCD_WriteReg(heareg,heaval);
		LCD_WriteReg(vsareg,vsaval);
		LCD_WriteReg(veareg,veaval);		
		LCD_SetCursor(sx,sy);	//设置光标位置
	}
} 
/**
 * @brief  LCD 初始化 (兼容接口): 内部失败时进入 Error_Handler
 * @note   需要错误处理请改用 LCD_InitEx()
 */
void LCD_Init(void)
{
	if (LCD_InitEx() != LCD_OK) {
		Error_Handler();
	}
}

/**
 * @brief  LCD 初始化: 时钟/GPIO/FSMC 配置, 读取驱动 IC ID 并装载初始化序列
 * @retval LCD_OK: 成功; LCD_ERR_INIT: GPIO/FSMC 初始化失败;
 *         LCD_ERR_UNSUPPORTED_ID: 驱动 IC ID 无法识别
 * @note   该初始化函数支持多种驱动 IC (自动识别), 其余绘图函数为通用实现;
 *         初始化完成后默认竖屏显示并点亮背光
 */
LCD_Status LCD_InitEx(void)
{
	vu32 i=0;
	GPIO_InitTypeDef  GPIO_InitStructure;
	FSMC_NORSRAM_InitTypeDef  FSMC_NORSRAM_InitStructure;
	FSMC_NORSRAM_TimingTypeDef  readWriteTiming;
	FSMC_NORSRAM_TimingTypeDef  writeTiming;

	delay_init();   /* DWT us-delay init */

	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_FSMC_CLK_ENABLE();

	/* LCD backlight: PB1 output high */
	GPIO_InitStructure.Pin = LCD_BL_PIN;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(LCD_BL_GPIO_PORT, &GPIO_InitStructure);

	/* FSMC data bus & control pins (PD group) */
	GPIO_InitStructure.Pin = LCD_FSMC_D_GPIO_PINS;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStructure.Alternate = GPIO_AF12_FSMC;
	HAL_GPIO_Init(LCD_FSMC_D_GPIO_PORT, &GPIO_InitStructure);

	/* FSMC data pins (PE7~PE15) */
	GPIO_InitStructure.Pin = LCD_FSMC_E_GPIO_PINS;
	HAL_GPIO_Init(LCD_FSMC_E_GPIO_PORT, &GPIO_InitStructure);

	/* FSMC NOR/SRAM: Bank1 NE1, 16-bit, SRAM mode */
	readWriteTiming.AddressSetupTime = LCD_FSMC_READ_ADDR_SETUP;
	readWriteTiming.AddressHoldTime = LCD_FSMC_ADDR_HOLD;
	readWriteTiming.DataSetupTime = LCD_FSMC_READ_DATA_SETUP;
	readWriteTiming.BusTurnAroundDuration = LCD_FSMC_BUS_TURNAROUND;
	readWriteTiming.CLKDivision = LCD_FSMC_CLK_DIVISION;
	readWriteTiming.DataLatency = LCD_FSMC_DATA_LATENCY;
	readWriteTiming.AccessMode = LCD_FSMC_ACCESS_MODE;

	writeTiming.AddressSetupTime = LCD_FSMC_WRITE_ADDR_SETUP;
	writeTiming.AddressHoldTime = LCD_FSMC_ADDR_HOLD;
	writeTiming.DataSetupTime = LCD_FSMC_WRITE_DATA_SETUP;
	writeTiming.BusTurnAroundDuration = LCD_FSMC_BUS_TURNAROUND;
	writeTiming.CLKDivision = LCD_FSMC_CLK_DIVISION;
	writeTiming.DataLatency = LCD_FSMC_DATA_LATENCY;
	writeTiming.AccessMode = LCD_FSMC_ACCESS_MODE;

