Cttangg/stm32project/2.8-inch_LCD_Driver/Core/Lib/lcd.c
	FSMC_NORSRAM_InitStructure.NSBank = FSMC_NORSRAM_BANK1;
	FSMC_NORSRAM_InitStructure.DataAddressMux = FSMC_DATA_ADDRESS_MUX_DISABLE;
	FSMC_NORSRAM_InitStructure.MemoryType = FSMC_MEMORY_TYPE_SRAM;
	FSMC_NORSRAM_InitStructure.MemoryDataWidth = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
	FSMC_NORSRAM_InitStructure.BurstAccessMode = FSMC_BURST_ACCESS_MODE_DISABLE;
	FSMC_NORSRAM_InitStructure.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
	FSMC_NORSRAM_InitStructure.WrapMode = FSMC_WRAP_MODE_DISABLE;
	FSMC_NORSRAM_InitStructure.WaitSignalActive = FSMC_WAIT_TIMING_BEFORE_WS;
	FSMC_NORSRAM_InitStructure.WriteOperation = FSMC_WRITE_OPERATION_ENABLE;
	FSMC_NORSRAM_InitStructure.WaitSignal = FSMC_WAIT_SIGNAL_DISABLE;
	FSMC_NORSRAM_InitStructure.ExtendedMode = FSMC_EXTENDED_MODE_ENABLE;
	FSMC_NORSRAM_InitStructure.AsynchronousWait = FSMC_ASYNCHRONOUS_WAIT_DISABLE;
	FSMC_NORSRAM_InitStructure.WriteBurst = FSMC_WRITE_BURST_DISABLE;
	FSMC_NORSRAM_InitStructure.ContinuousClock = 0;
	FSMC_NORSRAM_InitStructure.WriteFifo = 0;
	FSMC_NORSRAM_InitStructure.PageSize = FSMC_PAGE_SIZE_NONE;

	if (FSMC_NORSRAM_Init(FSMC_NORSRAM_DEVICE, &FSMC_NORSRAM_InitStructure) != HAL_OK) {
		return LCD_ERR_INIT;
	}
	if (FSMC_NORSRAM_Timing_Init(FSMC_NORSRAM_DEVICE, &readWriteTiming,
	                            FSMC_NORSRAM_InitStructure.NSBank) != HAL_OK) {
		return LCD_ERR_INIT;
	}
	if (FSMC_NORSRAM_Extended_Timing_Init(FSMC_NORSRAM_EXTENDED_DEVICE, &writeTiming,
	                                      FSMC_NORSRAM_InitStructure.NSBank,
	                                      FSMC_NORSRAM_InitStructure.ExtendedMode) != HAL_OK) {
		return LCD_ERR_INIT;
	}
	__FSMC_NORSRAM_ENABLE(FSMC_NORSRAM_DEVICE, FSMC_NORSRAM_InitStructure.NSBank);

	delay_ms(50);
	LCD_WriteReg(0x0000,0x0001);
	delay_ms(50);
	lcddev.id = LCD_ReadReg(0x0000);
	if(lcddev.id!=0X9341&&lcddev.id!=0X6804&&lcddev.id!=0X5310&&lcddev.id!=0X5510)
	{
		LCD_WR_REG(0XD3);
		lcddev.id=LCD_RD_DATA();
		lcddev.id=LCD_RD_DATA();
		lcddev.id=LCD_RD_DATA();
		lcddev.id<<=8;
		lcddev.id|=LCD_RD_DATA();
		if(lcddev.id!=0X9341)
		{
			LCD_WR_REG(0XBF);
			lcddev.id=LCD_RD_DATA();
			lcddev.id=LCD_RD_DATA();
			lcddev.id=LCD_RD_DATA();
			lcddev.id=LCD_RD_DATA();
			lcddev.id<<=8;
			lcddev.id|=LCD_RD_DATA();
			if(lcddev.id!=0X6804)
			{
				LCD_WR_REG(0XD4);
				lcddev.id=LCD_RD_DATA();
				lcddev.id=LCD_RD_DATA();
				lcddev.id=LCD_RD_DATA();
				lcddev.id<<=8;
				lcddev.id|=LCD_RD_DATA();
				if(lcddev.id!=0X5310)
				{
					LCD_WR_REG(0XDA00);
					lcddev.id=LCD_RD_DATA();
					LCD_WR_REG(0XDB00);
					lcddev.id=LCD_RD_DATA();
					lcddev.id<<=8;
					LCD_WR_REG(0XDC00);
					lcddev.id|=LCD_RD_DATA();
					if(lcddev.id==0x8000)lcddev.id=0x5510;
				}
			}
		}
	}
	/* 驱动 IC ID 校验: 无法识别时快速失败 (由调用方处理) */
	if(lcddev.id!=0X9341&&lcddev.id!=0X6804&&lcddev.id!=0X5310&&lcddev.id!=0X5510
	   &&lcddev.id!=0X9325&&lcddev.id!=0X9328&&lcddev.id!=0X9320&&lcddev.id!=0X9331
	   &&lcddev.id!=0X5408&&lcddev.id!=0X1505&&lcddev.id!=0XB505&&lcddev.id!=0XC505
	   &&lcddev.id!=0X4531&&lcddev.id!=0X4535)
	{
		return LCD_ERR_UNSUPPORTED_ID;
	}
	if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X5510)
	{
		FSMC_Bank1E->BWTR[6]&=~(0XF<<0);
		FSMC_Bank1E->BWTR[6]&=~(0XF<<8);
		FSMC_Bank1E->BWTR[6]|=3<<0;
		FSMC_Bank1E->BWTR[6]|=2<<8;
	}else if(lcddev.id==0X6804||lcddev.id==0XC505)
	{
		FSMC_Bank1E->BWTR[6]&=~(0XF<<0);
		FSMC_Bank1E->BWTR[6]&=~(0XF<<8);
		FSMC_Bank1E->BWTR[6]|=10<<0;
		FSMC_Bank1E->BWTR[6]|=12<<8;
	}
	if(lcddev.id==0X9341)	//9341初始化
	{	 
		LCD_WR_REG(0xCF);  
		LCD_WR_DATA(0x00);
		i++;
		LCD_WR_DATA(0xC1); 
		LCD_WR_DATA(0X30); 
		LCD_WR_REG(0xED);  
		LCD_WR_DATA(0x64); 
		LCD_WR_DATA(0x03); 
		LCD_WR_DATA(0X12); 
		LCD_WR_DATA(0X81); 
		LCD_WR_REG(0xE8);  
		LCD_WR_DATA(0x85); 
		LCD_WR_DATA(0x10); 
		LCD_WR_DATA(0x7A); 
		LCD_WR_REG(0xCB);  
		LCD_WR_DATA(0x39); 
		LCD_WR_DATA(0x2C); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x34); 
		LCD_WR_DATA(0x02); 
		LCD_WR_REG(0xF7);  
		LCD_WR_DATA(0x20); 
		LCD_WR_REG(0xEA);  
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_REG(0xC0);    //Power control 
		LCD_WR_DATA(0x1B);   //VRH[5:0] 
		LCD_WR_REG(0xC1);    //Power control 
		LCD_WR_DATA(0x01);   //SAP[2:0];BT[3:0] 
		LCD_WR_REG(0xC5);    //VCM control 
		LCD_WR_DATA(0x30); 	 //3F
		LCD_WR_DATA(0x30); 	 //3C
		LCD_WR_REG(0xC7);    //VCM control2 
		LCD_WR_DATA(0XB7); 
		LCD_WR_REG(0x36);    // Memory Access Control 
		LCD_WR_DATA(0x48); 
		LCD_WR_REG(0x3A);   
		LCD_WR_DATA(0x55); 
		LCD_WR_REG(0xB1);   
		LCD_WR_DATA(0x00);   
		LCD_WR_DATA(0x1A); 
		LCD_WR_REG(0xB6);    // Display Function Control 
		LCD_WR_DATA(0x0A); 
		LCD_WR_DATA(0xA2); 
		LCD_WR_REG(0xF2);    // 3Gamma Function Disable 
		LCD_WR_DATA(0x00); 
		LCD_WR_REG(0x26);    //Gamma curve selected 
		LCD_WR_DATA(0x01); 
		LCD_WR_REG(0xE0);    //Set Gamma 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x2A); 
		LCD_WR_DATA(0x28); 
		LCD_WR_DATA(0x08); 
		LCD_WR_DATA(0x0E); 
		LCD_WR_DATA(0x08); 
		LCD_WR_DATA(0x54); 
		LCD_WR_DATA(0XA9); 
		LCD_WR_DATA(0x43); 
		LCD_WR_DATA(0x0A); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 		 
		LCD_WR_REG(0XE1);    //Set Gamma 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x15); 
		LCD_WR_DATA(0x17); 
		LCD_WR_DATA(0x07); 
		LCD_WR_DATA(0x11); 
		LCD_WR_DATA(0x06); 
		LCD_WR_DATA(0x2B); 
		LCD_WR_DATA(0x56); 
		LCD_WR_DATA(0x3C); 
		LCD_WR_DATA(0x05); 
		LCD_WR_DATA(0x10); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x3F); 
		LCD_WR_DATA(0x3F); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_REG(0x2B); 
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x01);
		LCD_WR_DATA(0x3f);
		LCD_WR_REG(0x2A); 
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0xef);	 
		LCD_WR_REG(0x11); //Exit Sleep
		delay_ms(120);
		LCD_WR_REG(0x29); //display on	
	}else if(lcddev.id==0x6804) //6804初始化
	{
		LCD_WR_REG(0X11);
		delay_ms(20);
		LCD_WR_REG(0XD0);//VCI1  VCL  VGH  VGL DDVDH VREG1OUT power amplitude setting
		LCD_WR_DATA(0X07); 
		LCD_WR_DATA(0X42); 
		LCD_WR_DATA(0X1D); 
		LCD_WR_REG(0XD1);//VCOMH VCOM_AC amplitude setting
		LCD_WR_DATA(0X00);
		LCD_WR_DATA(0X1a);
		LCD_WR_DATA(0X09); 
		LCD_WR_REG(0XD2);//Operational Amplifier Circuit Constant Current Adjust , charge pump frequency setting
		LCD_WR_DATA(0X01);
		LCD_WR_DATA(0X22);
		LCD_WR_REG(0XC0);//REV SM GS 
		LCD_WR_DATA(0X10);
		LCD_WR_DATA(0X3B);
		LCD_WR_DATA(0X00);
		LCD_WR_DATA(0X02);
		LCD_WR_DATA(0X11);
		
		LCD_WR_REG(0XC5);// Frame rate setting = 72HZ  when setting 0x03
		LCD_WR_DATA(0X03);
		
