Cttangg/stm32project/2.8-inch_LCD_Driver/Core/Lib/lcd.c
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,0); 
	}
} 
/**
 * @brief  显示数字 (高位为 0 时按 mode 决定填充 '0' 或空格)
 * @param  x: 起点横坐标
 * @param  y: 起点纵坐标
 * @param  num: 数值 (0~999999999)
 * @param  len: 显示位数
 * @param  size: 字体大小
 * @param  mode: bit7=1 高位填 '0'; bit0=1 叠加显示
 */
void LCD_ShowxNum(u16 x,u16 y,u32 num,u8 len,u8 size,u8 mode)
{  
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				if(mode&0X80)LCD_ShowChar(x+(size/2)*t,y,'0',size,mode&0X01);  
				else LCD_ShowChar(x+(size/2)*t,y,' ',size,mode&0X01);  
 				continue;
			}else enshow=1; 
		 	 
		}
	 	LCD_ShowChar(x+(size/2)*t,y,temp+'0',size,mode&0X01); 
	}
} 
/**
 * @brief  显示字符串 (超出宽度自动换行, 超出区域自动截断)
 * @param  x: 起点横坐标
 * @param  y: 起点纵坐标
 * @param  width: 显示区域宽度
 * @param  height: 显示区域高度
 * @param  size: 字体大小
 * @param  p: 字符串起始地址
 */
void LCD_ShowString(u16 x,u16 y,u16 width,u16 height,u8 size,const char *p)
{         
	u8 x0=x;
	width+=x;
	height+=y;
    while((*p<='~')&&(*p>=' '))//判断是不是非法字符!
    {       
        if(x>=width){x=x0;y+=size;}
        if(y>=height)break;//退出
        LCD_ShowChar(x,y,*p,size,0);
        x+=size/2;
        p++;
    }  
}

/* ========================================================================= */
/*  图片显示: 32 位批量写 + 分片异步渲染                                       */
/* ========================================================================= */

/**
 * @brief  批量写一行像素 (32 位写 = 2 像素)
 * @param  src: 像素数据指针 (RGB565)
 * @param  n: 像素个数
 * @note   LCD_RAM 地址 (LCD_BASE+2 = 0x60080000) 4 字节对齐, 32 位访问安全;
 *         FSMC 16 位总线自动把 32 位写拆成两个背靠背写周期
 */
static void lcd_gram_write_batch(const u16 *src, u16 n)
{
#if (LCD_USE_32BIT_GRAM_WRITE == 1)
	/* 32 位批量写: 一次写 2 像素 (需实机验证, 见 lcd_conf.h) */
	volatile uint32_t *dst = (volatile uint32_t *)((uint32_t)&LCD->LCD_RAM);
	u16 i=0;
	for(;i+1<n;i+=2)
	{
		*dst=((u32)src[i+1]<<16)|src[i];
	}
	if(i<n)LCD->LCD_RAM=src[i];	//奇数像素补齐
#else
	/* 16 位逐像素写 (实机验证稳定) */
	u16 i;
	for(i=0;i<n;i++)LCD->LCD_RAM=src[i];
#endif
}

/** 异步刷屏任务 (同一时刻仅支持一个) */
static struct {
	u16 x,y,w,h;
	const u16 *img;
	u16 row;
	u8  active;
} g_lcd_job;

void LCD_ShowImage_Start(u16 x,u16 y,u16 w,u16 h,const u16 *img)
{
	g_lcd_job.x=x;g_lcd_job.y=y;
	g_lcd_job.w=w;g_lcd_job.h=h;
	g_lcd_job.img=img;
	g_lcd_job.row=0;
	g_lcd_job.active=1;
}

uint8_t LCD_ShowImage_Task(void)
{
	u16 row;
	if(!g_lcd_job.active)return 1;
	row=g_lcd_job.row;
	/* 逐行设置光标, 不依赖 0x50~0x53 窗口回绕
	 * (ILI9325 等克隆屏窗口回绕可能差 1 列, 导致逐行右移形成斜切) */
	if(lcddev.id==0X9341||lcddev.id==0X5310)
	{
		LCD_WR_REG(lcddev.setxcmd);
		LCD_WR_DATA(g_lcd_job.x>>8);LCD_WR_DATA(g_lcd_job.x&0XFF);
		LCD_WR_REG(lcddev.setycmd);
		LCD_WR_DATA((g_lcd_job.y+row)>>8);LCD_WR_DATA((g_lcd_job.y+row)&0XFF);
	}else
	{
		LCD_WriteReg(lcddev.setxcmd,g_lcd_job.x);
		LCD_WriteReg(lcddev.setycmd,g_lcd_job.y+row);
	}
	LCD_WriteRAM_Prepare();
	lcd_gram_write_batch(&g_lcd_job.img[(u32)row*g_lcd_job.w],g_lcd_job.w);
	g_lcd_job.row++;
	if(g_lcd_job.row>=g_lcd_job.h){g_lcd_job.active=0;return 1;}
	return 0;
}

void LCD_ShowImage_Stop(void)
{
	g_lcd_job.active=0;
}

/**
 * @brief  显示图片 (阻塞): 同步刷完整帧后返回
 * @param  x: 图片左上角横坐标
 * @param  y: 图片左上角纵坐标
 * @param  w: 图片宽度
 * @param  h: 图片高度
 * @param  img: 图片数据指针 (RGB565, 逐行存放)
 */
void LCD_ShowImage(u16 x,u16 y,u16 w,u16 h,const u16 *img)
{
	LCD_ShowImage_Start(x,y,w,h,img);
	while(!LCD_ShowImage_Task()){}
}

